Revit 2021.1 API
PostableCommand Enumeration
 Enumerates all of the built-in commands which can be posted by an API application.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
public enum PostableCommand
Visual Basic
Public Enumeration PostableCommand
Visual C++
public enum class PostableCommand
Members
Member name | Description
RoofByFace |  Creates a roof using a non-vertical face of a mass.
Soffit |  Creates a roof soffit in the building model.
RepeatComponent |  Repeats the selected applied component along a divide path or surface.
ViewList |  Creates a schedule of the views in the project.
LinearDimensionTypes |  Defines attributes for linear (horizontal and vertical) dimensions.
AngularDimensionTypes |  Defines attributes for angular dimensions.
SplitElement |  Cuts an element (such as a wall or line) at a selected point, or removes a segment between 2 points.
SpotElevation |  Displays the elevation of a selected point.
SpotCoordinate |  Displays the North/South and East/West coordinates of points in a project.
RoofByFootprint |  Creates a roof using the building footprint to define its boundaries.
RoofByExtrusion |  Creates a roof by extruding a profile that you sketch.
RadialDimensionTypes |  Defines attributes for radial dimensions.
ReloadLatest |  Loads updates from the central model to your local copy of the project.
Render |  Creates a photorealistic image of a building model.
ShowHistory |  Displays a list of all the times a workshared file (the central model or a local copy of the central model) was saved and who saved it.
SplitSurface |  Splits a toposurface into 2 distinct surfaces, so that each can be edited independently.
DrawOnFace |  Draws lines on existing surfaces.
DrawOnWorkPlane |  Draws lines on the active work plane.
GrayInactiveWorksets |  Displays elements in inactive worksets as gray to visually distinguish them from elements in active worksets.
ImportGBXML |  Imports analysis data from a gbXML file.
ExportReportsRoomOrAreaReport |  Saves a schedule or Room/Area report.
SheetIssuesOrRevisions |  Specifies revision information for the project.
RevisionSchedule |  Adds a revision schedule to a custom title block.
CalloutTags |  Specifies the callout head for callout tags, and the radius of the callout bubble.
ElevationTags |  Defines properties for elevation tags.
SectionTags |  Specifies the shape of heads and tails for section tags.
FloorByFaceFloor |  Converts a mass floor into a floor of the building model.
HideCategory |  Hides all elements that belong to a selected category in the current view.
RunInterferenceCheck |  Locates invalid intersections between elements in a project.
SpecifyCoordinatesAtPoint |  Relocates a project and rotates the project to True North by specifying coordinates for North/South, East/West, and Elevation.
ExportIFC |  Saves an IFC file.
SystemBrowser |  System.Windows.Controls.StackPanel
PublishDWGToAutodeskBuzzsaw |  Saves selected views and sheets as DWG files and posts them to a Autodesk Buzzsaw site.
PublishDWFToAutodeskBuzzsaw |  Saves selected views and sheets as DWF files and posts them to a Autodesk Buzzsaw site.
PublishDXFToAutodeskBuzzsaw |  Saves selected views and sheets as DXF files and posts them to a Autodesk Buzzsaw site.
PublishDGNToAutodeskBuzzsaw |  Saves selected views and sheets as DGN files and posts them to a Autodesk Buzzsaw site.
ResetAnalyticalModel |  Resets the analytical model alignment methods to Auto-detect.
PublishSATToAutodeskBuzzsaw |  Saves selected views and sheets as SAT files and posts them to a Autodesk Buzzsaw site.
ExportOptionsIFCOptions |  Sets export options for CAD and IFC.
TypeProperties |  Displays properties for the family type to which the selected element belongs.
ExportDWFOrDWFx |  Creates DWF or DWFx files.
ExportCADFormatsDWG |  Creates DWG, DXF, DGN, SAT, or STL files.
ExportCADFormatsDXF |  Creates DWG, DXF, DGN, SAT, or STL files.
ExportCADFormatsDGN |  Creates DWG, DXF, DGN, SAT, or STL files.
ExportCADFormatsACIS_SAT |  Creates DWG, DXF, DGN, SAT, or STL files.
ExportCADFormatsSTL |  Creates DWG, DXF, DGN, SAT, or STL files.
RelinquishAllMine |  Releases ownership of worksets and borrowed elements that have not been changed.
MaterialTakeoff |  Creates a list of the sub-components or materials of any Revit family category.
DWFMarkup |  Links marked-up DWF files into a Revit project so you can see the markups on corresponding sheets.
ImportTypes |  Imports family types from a text (.txt) file into the current family.
ExportExportTypes |  Exports family types from the current family to a text (.txt) file.
CheckMemberSupports |  Verifies that structural elements such as beams, columns, walls, and slabs, are joined to supporting elements.
AnalyticalConsistencyChecks |  Verifies the analytical and physical model for consistency.
KeynoteLegend |  Creates a list of the keynotes used in a project, and their definitions.
KeynotingSettings |  Specifies the location of the keynote table and the numbering method for keynotes.
OpenBuildingComponent |  Opens a building component Autodesk Exchange (ADSK) file.
Web |  Draws the web elements between the chords.
TopChord |  Draws the top chord of the truss family.
BottomChord |  Draws the bottom chord of the truss family.
TogglePropertiesPalette |  Displays or hides a palette where you can view and edit instance properties.
StatusBarWorksets |  For a workshared project, displays the active workset and the number of Others' pending Editing Requests in the status bar.
StatusBarDesignOptions |  Displays the active design option in the status bar.
ReinforcementNumbers |  Defines or edits numbering sequences by partition for rebar and fabric sheets.
FamilyCategoryAndParameters |  Assigns the properties of a predefined family category to the component you are creating.
ExportImagesandAnimationsWalkthrough |  Saves animations or image files.
ExportImagesandAnimationsSolarStudy |  Saves animations or image files.
SunSettings |  Specifies the location of the sun in the sun path, solar studies, walkthroughs, and rendered images.
Grid |  Places column grid lines in the building design.
ArchitecturalWall |  Creates a non-structural wall in the building model.
Door |  Adds doors to the building model.
Window |  Adds windows to the building model.
Delete |  Removes selected elements from the building model.
Space |  Places analytical spaces to account for the entire volume within the model. This includes rooms, plenums and chases.
SpaceTag |  Labels spaces in a project.
SpaceSeparator |  Draws a space separation line to divide space.
Level |  Places a level in a view.
FramingElevation |  Creates a framing elevation to show vertical bracing.
ArchitecturalFloor |  Creates a floor for the current level of the building model.
Stair |  Adds a stair to the building model by creating common run, landing, and support components.
ArchitecturalColumn |  Adds architectural columns to the building model.
MirrorProject |  Flips the position of a project around a selected axis.
RotateProjectNorth |  Changes the relationship of all elements relative to Project North (the top of the drawing area) in plan views.
Rotate |  Rotates selected elements around an axis.
MirrorPickAxis |  Reverses the position of selected elements, using an existing line or edge as the mirror axis.
LineWeights |  Creates or modifies line weights.
ObjectStyles |  Specifies line weights, colors, and patterns, and materials for model objects, annotation objects, and imported objects.
AnalysisDisplayStyles |  Specifies a presentation format for visualizing analysis results.
Snaps |  Specifies snap increments, and enables or disables snap points.
ProjectUnits |  Specifies the display format for units of measure.
StructuralPlan |  Creates a structural plan view.
FloorPlan |  Creates a floor plan view.
Section |  Creates a section view.
Camera |  Creates a 3D view from the perspective of a camera placed in the view.
ProjectBrowser |  Displays the Project Browser.
NewSheet |  Creates a page for a document set.
ImportCAD |  Imports vector data from other CAD programs to the Revit project.
LinkCAD |  Links a CAD file to the current Revit project.
PointCloud |  Links a Point Cloud file (*.rcp or *.rcs) into the current project.
NewFamilyFile |  Create a new family
LoadShapes |  Loads a Revit family into the current file.
NewConceptualMass |  Opens a template for creating a conceptual massing model.
Pin |  Locks a model element in place.
Unpin |  Unlocks a model element so it can move.
SolidExtrusion |  Creates a 3D solid by extruding a 2D shape (profile).
PlaceAComponent |  Places an element in the building model, based on a selected element type.
ModelLine |  Creates a line that exists in 3D space and is visible in all views of a project.
StairPath |  Annotates the slope direction and walk line of a stair.
ReferencePlane |  Creates a reference plane using drawing tools.
Redo |  Redo last undone action
Undo |  Undo last action
Control |  Adds a flip arrow to the view.
Filters |  Creates a filter to modify the visibility and graphics of elements in views based on element parameters.
TemporaryDimensions |  Specifies the placement and component references for temporary dimensions.
LinePatterns |  Creates or modifies line patterns.
Array |  Creates a linear or radial array of selected elements.
Move |  Moves selected elements to the specified location in the current view.
Copy |  Copies selected elements and places them in the specified location in the current view.
PlaceView |  Adds a view to a sheet.
Text |  Adds text annotations (notes) to the current view.
NewTitleBlock |  Opens a template for creating a Title Block family.
AutomaticCeiling |  Creates a ceiling at a specified distance above the level in which it resides.
FillPatterns |  Creates or modifies drafting patterns and model patterns.
Default3DView |  Opens the default orthographic 3D view.
Label |  Creates a label for the annotation symbol.
VisibilityOrGraphics |  Controls the visibility and graphic display of model elements, annotations, imported and linked elements, and workset elements in a view.
ViewRange |  Controls the view range of a plan.
Opening |  Creates an opening in a host, such as a wall or ceiling.
NewRevitFile |  Create a new project
ActivateView |  Enables you to modify the selected view without leaving the sheet.
Materials |  Specifies the materials and associated properties to apply to elements in the building model.
DeactivateView |  Deactivates the view, so you can no longer change the view from the sheet.
MaterialAssets |  Modifies the assets that define a material.
DecalTypes |  Creates a decal that you can use to place images on surfaces of a building model for rendering.
Options |  Options.
Room |  Creates a room bounded by model elements (such as walls, floors, and ceilings) and separation lines.
CurtainGrid |  Creates a grid line in a curtain wall or curtain system.
CurtainWallMullion |  Creates a horizontal or vertical mullion on a curtain grid.
FamilyTypes |  Allows you to enter parameter values for existing family types, add parameters to the family, or create new types within the family.
FilledRegion |  Creates a 2D, view-specific graphic with a fill pattern and a boundary line.
RoomTag |  Tags the selected room.
Align |  Aligns one or more elements with a selected element.
Symbol |  Places a 2D annotation drawing symbol in the current view.
DuplicateView |  Creates a view that contains only the model geometry from the current view.
ExportOptionsExportSetupsDGN |  Sets export options for CAD and IFC.
ExportOptionsExportSetupsDWGOrDXF |  Sets export options for CAD and IFC.
ColorFillLegend |  Places a legend in a view to indicate the meanings of color fills for rooms or areas.
BuildingElevation |  Creates an elevation view.
JoinOrUnjoinRoof |  Connects roofs to other roofs or walls, or reverses a previous join.
SolidBlend |  Creates a solid 3D shape that changes along its length, blending from a starting shape to an ending shape.
ManageLinks |  Provides options for managing links to building models, CAD files, DWF markup files, and point clouds.
SolidRevolve |  Creates a 3D shape by sweeping a 2D profile around an axis.
ScheduleOrQuantities |  Creates a key schedule or a schedule of building components.
Callout |  Creates a rectangular callout in the view.
SolidSweep |  Creates a 3D shape by sweeping a 2D profile along a path.
CreateGroup |  Creates a group of elements for easy reuse.
Ramp |  Adds a ramp to the building model.
RoomSeparator |  Creates a separation line to bound rooms where no walls or other room-bounding elements exist.
AlignedToCurrentView |  Pastes elements that were cut or copied from another view into the current view.
AlignedToPickedLevel |  Pastes the selected elements into a elevation view or a section view.
WallJoins |  Changes how walls join together (butt, miter, square off).
StartingView |  Specifies the view that first displays when you open the model.
AlignedToSelectedLevels |  Pastes multiple elements from one level to specified levels.
TagByCategory |  Attaches a tag to an element based on the element category.
AlignedToSelectedViews |  Pastes selected elements, including view-specific elements such as dimensions, into specified views.
LoadedTagsAndSymbols |  Lists the tags and symbols that will be used for each element category.
NewAnnotationSymbol |  Creates a tag or symbol to identify elements in the project.
AlignedToSamePlace |  Pastes the elements to the same place from which they were cut or copied.
SpotSlopeTypes |  Defines attributes for spot slopes.
Arrowheads |  Specifies line weights, fills, and styles for annotation arrowheads.
SpotElevationTypes |  Defines attributes for spot elevations.
SpotCoordinateTypes |  Defines attributes for spot coordinates.
ReviewWarnings |  Displays a list of messages that you can ignore or resolve.
LineStyles |  Creates or modifies line styles.
ReflectedCeilingPlan |  Creates a reflected ceiling plan view.
DetailLevel |  Specifies the detail level (coarse, medium, or fine) that applies to each view scale by default.
VoidExtrusion |  Creates a 3D shape that is then used to remove part of a solid 3D shape.
VoidBlend |  Creates a 3D blend, which is then used to remove part of a solid 3D shape.
VoidRevolve |  Creates a 3D shape by sweeping a 2D profile around an axis, and uses the 3D shape to remove part of a solid 3D shape.
VoidSweep |  Creates a 3D shape by sweeping a 2D profile along a path, and uses the resulting 3D shape to remove part of a solid 3D shape.
CutGeometry |  Selects the geometry to cut.
UncutGeometry |  Selects which geometry does not get cut when you join geometry.
PlaceDetailGroup |  Places an instance of a detail group in the view.
OverrideByCategory |  Changes the graphic display settings for all elements that belong to the same category as the selected element in the current view.
DetailComponent |  Adds a view-specific detail component to a view.
DetailLine |  Creates view-specific lines.
Insulation |  Places a batt insulation graphic in a detail view.
CreateSimilar |  Places an element of the same type as the selected element
Worksets |  Creates worksets and adds elements to them.
Phases |  Specifies project phases, phase filters, and graphic overrides for phases.
PropertyLine |  Creates a property line in a plan view.
BuildingPad |  Adds a building pad from a closed loop that you sketch on a toposurface.
MatchTypeProperties |  Converts one or more elements to match the type of another element in the same view.
ScopeBox |  Controls the visibility of datum elements (grids, levels, and reference lines) in specific views.
Linework |  Overrides the line style for a selected line in the active view only.
SetWorkPlane |  Specifies the work plane for the current view or for a selected work-plane–based element.
DraftingView |  Creates a view showing details that are not directly associated with the building model.
Legend |  Creates a list of building components and annotations used in a project.
Demolish |  Marks elements as demolished in the current phase.
RevisionCloud |  Adds a revision cloud to the current view or sheet to indicate design areas that have changed.
SynchronizeAndModifySettings |  Allows you to specify options for the synchronization operation.
ProjectInformation |  Specifies energy data, project status, and client information.
ModelInPlace |  Creates a component that is unique to the project.
SheetList |  Creates a schedule that lists the drawings in the project.
AreaPlan |  Creates an area plan view.
GradedRegion |  Modifies a toposurface to indicate changes during the construction process.
Toposurface |  Defines a topographical surface in a site plan or a 3D view.
ManageImages |  Lists all raster images used in the project.
ApplyTemplatePropertiesToCurrentView |  Applies properties stored in a view template to the current view.
RevealWall |  Extrudes a profile along a path to create a cutout in a wall.
SweepWall |  Creates a wall sweep by extruding a profile along a path.
Paint |  Applies a material to the face of an element.
RemovePaint |  Removes paint from selected faces.
NoteBlock |  Creates a schedule of annotations added using the Symbol tool.
ModelText |  Adds 3D text to the building model.
ShowHiddenLinesByElement |  Displays hidden lines for individual model elements and detail elements that are obscured by other elements in the current view.
RemoveHiddenLinesByElement |  Removes hidden lines for model elements and detail elements that are obscured by other elements in the active view only.
ManageViewTemplates |  Displays parameters for view templates in the project.
CreateTemplateFromCurrentView |  Creates a view template using the properties of the current view as the basis for the new template.
RestoreBackup |  Rolls back changes made to a workshared project, or saves a specific backup version as a new file.
ExportODBCDatabase |  Saves model data to an ODBC database.
LoadAsGroup |  Loads a Revit file as a group.
SaveAsLibraryGroup |  Saves a copy of all loaded families, the selected family, group, or view to your library.
ParkingComponent |  Adds parking spaces to a toposurface.
TransferProjectStandards |  Copies selected project settings from another open project to the current project.
SymbolicLine |  Creates lines that are meant for symbolic purposes only, and are not part of the actual geometry of the component or building model.
CutProfile |  Changes the shape of elements that are cut in a view, such as roofs, walls, floors, and the layers of compound structures.
ExportReportsSchedule |  Saves a schedule or Room/Area report.
CloseInactiveViews |  Closes views that are not active.
AreaTag |  Tags the selected area.
AreaBoundary |  Defines boundaries for areas.
Area |  Creates an area defined by walls and boundary lines.
JoinGeometry |  Creates clean joins between 2 or more host elements that share a common face, such as walls and floors.
UnjoinGeometry |  Removes a join between 2 or more elements.
SwitchJoinOrder |  Changes the order in which elements join with one another.
TagAllNotTagged |  Adds tags to multiple elements in one step.
MergeSurfaces |  Combines 2 toposurfaces to create one toposurface.
SharedParameters |  Specifies parameters that can be used in multiple families and projects.
LegendComponent |  Adds a graphic representation of a selected model element to a legend view.
Offset |  Copies or moves a selected element (such as a line, wall, or beam) a specified distance perpendicular to its length.
PurgeUnused |  Removes unused families and types from a project.
PlaceDecal |  Places an image on surfaces of a building model for rendering.
RebarLine |  Defines lines and geometry of the rebar shape.
LabelContours |  Displays the elevations of contour lines.
SplitWithGap |  Splits a wall into 2 separate walls with a defined gap between them.
ThinLines |  Displays all lines on screen as a single width, regardless of zoom level.
LinkRevit |  Links another model to the current model.
ExportImagesandAnimationsImage |  Saves animations or image files.
ProjectParameters |  Specifies parameters that can be added to categories of elements in a project, and used in schedules.
RelocateProject |  Moves the model relative to the shared coordinate system.
RotateTrueNorth |  Changes the angle for a project relative to True North.
DuplicateWithDetailing |  Creates a view that includes model geometry and view-specific elements from the current view.
Location |  Specifies the geographic location for the project.
AcquireCoordinates |  Determines the coordinates used in a linked project, and uses them for the current project.
ReportSharedCoordinates |  Displays shared coordinates of a linked model within a host model.
IdsOfSelection |  Displays unique identifiers for the selected elements.
SelectById |  Uses an element’s unique identifier to locate and select the element in the current view.
PublishCoordinates |  Determines the coordinates used in the current project, and uses them for a linked project.
PlanRegion |  Creates a plan region within a view.
BrowserOrganization |  Changes the way that views are listed in the Project Browser.
Matchline |  Adds matchlines to indicate where a view is split.
ViewReference |  Adds an annotation indicating the sheet number and detail number for a selected view.
DesignOptions |  Creates and manages design option sets and individual design options for the project.
AddToSet |  Moves selected elements from the main model to one or more design options in a set.
PickToEdit |  Opens a design option for editing by selecting an element contained in the option.
EditingRequests |  Displays a list of other users’ requests to borrow elements in your worksets, and your pending requests.
SaveAsLibraryFamily |  Saves a copy of all loaded families, the selected family, group, or view to your library.
Subregion |  Defines an area within a toposurface.
Railing |  Creates a railing by sketching the railing path.
Beam |  Adds individual beams, a chain of beams, or beams along grid lines.
Brace |  Adds diagonal structural members connected to beams and columns.
StructuralColumn |  Adds a vertical load-bearing element to the building model.
StructuralWall |  Creates a load-bearing or shear wall in the building model.
SpanDirectionSymbol |  Places a span direction symbol on a structural floor.
StructuralFloor |  Creates a structural floor (slab) for the current level of the building model.
Scale |  Resizes the selected item.
Loads |  Applies point, line, and area loads to a model.
StructuralSettings |  Defines settings for analytical elements and the display of structural framing.
ReferenceLine |  Creates a reference line that you can use when creating a new mass, or to create constraints for the mass.
RebarCoverSettings |  Adds, removes, or modifies the default rebar cover settings.
ShowMassFormAndFloors |  Displays mass forms and any mass floors you have specified in all views.
CurtainSystemByFace |  Creates a curtain system on the face of a mass or generic model.
WallByFaceWall |  Creates walls using faces of a mass or generic model.
ShowMassByViewSettings |  Displays masses based on the settings for the current view. By default, masses are turned off.
ShowMassSurfaceTypes |  Displays mass faces, including any glazing and shades that have been specified.
ShowMassZonesAndShades |  Displays mass zones, glazing, and shades if they have been specified.
StructuralRebar |  Places planar or multi-planar rebar.
UseCurrentProject |  Displays warnings for monitored elements in the current project.
SelectLink |  Displays warnings for monitored elements between linked projects and the host project.
Wall |  Creates foundations hosted by walls.
Isolated |  Adds footings or pile caps to the building model.
MaterialTag |  Tags a selected element using the description specified for its material.
CoordinationSettings |  Specifies mapping behavior when copying MEP fixtures from a linked model into the current project.
Slab |  Adds a foundation slab to the building model.
ElementKeynote |  Tags a selected element using the keynote specified for the element type.
MaterialKeynote |  Tags a selected element using the keynote specified for its material.
UserKeynote |  Tags an element with a keynote that you select.
LoadSelection |  Loads a previously saved selection set.
SaveSelection |  Saves the currently selected elements as a set.
EditSelection |  Edits a previously saved selection set.
MultiCategoryTag |  Attaches tags to elements of multiple categories, based on a shared parameter.
BoundaryConditions |  Defines point, line, and area boundary conditions in an analytical model.
StructuralPathReinforcement |  Sketches the path of evenly placed reinforcing bars that are created perpendicular to the sketch.
PathReinforcementSymbol |  Places a symbol that shows extents and hook types for the selected path reinforcement.
OpeningByFace |  Creates an opening that is perpendicular to the selected face of a roof, floor, or ceiling.
VerticalOpening |  Cuts a vertical opening through a roof, floor, or ceiling.
DormerOpening |  Cuts a roof to create an opening for a dormer.
WallOpening |  Cuts a rectangular opening in a straight or curved wall.
ShaftOpening |  Creates a vertical opening that spans multiple levels, cutting through intervening roofs, floors, and ceilings.
SpotSlope |  Displays the slope at a specific point on a face or an edge of a model element.
HideElements |  Hides selected elements in the current view.
OverrideByElement |  Changes the graphic display settings for selected elements in the current view.
OverrideByFilter |  Changes the graphic display settings for all elements in the view that meet the criteria specified in a filter.
DuplicateAsDependent |  Creates a view that is dependent on the original view.
MaskingRegion |  Creates a graphic that obscures elements in a project or family.
MajorSegment |  Identifies one segment of the rebar shape that maintains its general position in rotation and auto-expansion behaviors.
ReinforcementSettings |  Customizes reinforcement settings such as rounding parameters, rebar hosting and abbreviations of area/path reinforcement tagging.
ExportFBX |  Saves a 3D view as an FBX file.
RecentFiles |  Displays a list of recently opened files, and provides access to important resources and links.
OpenFamilyFile |  Open an existing family
CreateParts |  Creates parts from the layers or subcomponents of a selected element.
ViewCube |  Shows or hides the ViewCube, which allows you to change the orientation of a 3D view.
BeamAnnotations |  Places multiple beam tags, annotations, and spot elevations.
AllowableBarTypes |  Defines the allowable rebar types (diameters) of the shape type.
MacroManager |  Opens the Macro Manager to run, create, or delete a macro.
MacroSecurity |  Specifies the default security settings for macros in the Revit application or a document.
NavigationBar |  Shows or hides the navigation bar, which provides access to the ViewCube, SteeringWheels, and zoom/pan functions.
ExportBuildingSite |  Exports an ADSK exchange file.
FormWorkPlaneView |  Enables the Workplane Viewer.
ReconcileHosting |  Lists tags and elements hosted by the linked model that require review, due to changes in the linked model.
SplitFace |  Divides the face of an element (such as a wall or column) into regions for the application of different materials.
AdjustAnalyticalModel |  Adjusts the analytical model of the structural member in relation to those of the elements to which it joins.
DiameterDimension |  Places a dimension that measures the diameter of an arc or circle.
DiameterDimensionTypes |  Defines attributes for diameter dimensions.
StructuralFabricArea |  Sketches the boundary of a fabric area to populate with fabric sheets.
FabricReinforcementSymbol |  Places a symbol that represents the fabric sheet.
PlaceOnHost |  Places a railing on a stair or ramp.
DuctPressureLossReport |  Generates a pressure loss report for one or more duct systems.
PipePressureLossReport |  Generates a pressure loss report for one or more pipe systems.
OpenSampleFiles |  Opens a Revit sample file.
SingleFabricSheetPlacement |  Places a single fabric sheet on floors, walls, and foundation slabs.
AlignedMultiRebarAnnotation |  Tags multiple elements with a single annotation that displays aligned dimensions between references as well as parameters from the referenced elements. For example, all rebar in a rebar set can be referenced with a single tag.
LinearMultiRebarAnnotation |  Tags multiple elements with a single annotation that displays linear dimensions between references as well as parameters from the referenced elements. For example, all rebar in a rebar set can be referenced with a single tag.
FabricationSettings |  Opens the Fabrication Settings dialog.
LinkIFC |  Links an IFC file to the current project to reference its information for additional design work.
SelectionBox
DuctAccessory |  Places a duct accessory. These accessories include dampers, filters and smoke detectors.
AirTerminal |  Places a register, grille, or diffuser.
Duct |  Draws rigid round, rectangular, or oval ductwork.
MechanicalEquipment |  Places mechanical equipment such as boilers, furnaces, or fans.
DuctFitting |  Places a duct fitting. These fittings include elbows, tees, wyes, crosses, and other types of fittings.
FlexDuct |  Draws round and rectangular flexible ductwork.
ConvertToFlexDuct |  Changes a length of ductwork connected to an air terminal from rigid duct to flexible duct.
DuctLegend |  Places a legend to indicate the color fills associated with ductwork in duct systems.
PanelSchedules |  Generates a panel schedule for a specified panel.
ElectricalSettings |  Opens the Electrical Settings dialog to define distribution systems, wire types, cable tray and conduit sizes, and demand factors.
LoadClassifications |  Assigns and specifies demand factors to a load classification.
LightingFixture |  Places lighting fixtures such as ceiling, wall, and recessed lights.
ElectricalEquipment |  Places electrical equipment such as panels and switch gear.
ElectricalFixture |  Places electrical devices such as receptacles, junction boxes, and other power devices.
CheckCircuits |  Verifies all circuits for proper connections to panels and valid system assignments. Errors are reported in a warning dialog.
DemandFactors |  Applies demand factors to a panel.
Pipe |  Draws rigid piping.
FlexPipe |  Draws flexible piping.
PipeFitting |  Places a pipe fitting. These fittings include elbows, tees, wyes, crosses, unions, and other types of fittings.
PipeAccessory |  Places a pipe accessory. These accessories include connectors, valves, and inline water heaters.
ArcWire |  Draws arced wire runs.
PipeLegend |  Places a legend to indicate the color fills associated with piping systems.
CheckPipeSystems |  Verifies all pipe systems for properly connected pipes and valid system assignments.
CheckDuctSystems |  Verifies all duct systems for properly connected ductwork and valid system assignments.
MechanicalSettings |  Opens the Mechanical Settings dialog.
PlumbingFixture |  Places plumbing fixtures. These fixtures include sinks, water closets, tubs, drains, and various appliances.
HeatingAndCoolingLoads |  Prepares a heating and cooling loads analysis report based on the existing building model.
Sprinkler |  Places a sprinkler.
ElectricalConnector |  Adds an electrical connector to a component.
DuctConnector |  Adds a duct connector to a component.
PipeConnector |  Adds a pipe connector to a component.
Zone |  Defines HVAC zones within a project.
BuildingOrSpaceTypeSettings |  Opens the Building and Space Type Settings dialog to manage building and space parameters and schedules.
ChamferedWire |  Draws chamfered wire runs.
SplineWire |  Draws splined wire runs.
Communication |  Places communication devices such as intercom system components.
Data |  Places data devices such as ethernet and other network connections.
FireAlarm |  Places fire alarm devices such as smoke detectors, manual pull stations, and annunciators.
Lighting |  Places lighting switches such as daylight sensors, occupancy sensors, and manual switches.
NurseCall |  Places nurse call devices such as call stations, code blue stations, and door lights.
Security |  Places security devices such as door locks, motion sensors, and surveillance cameras.
Telephone |  Places a telephone jack.
CableTrayConnector |  Adds a cable tray connector to a component.
ConduitConnector |  Adds a conduit connector to a component.
CableTrayFitting |  Places a cable tray fitting. These fittings include elbows, tees, wyes, crosses, and other unions.
ConduitFitting |  Places a conduit fitting. These fittings include elbows, tees, wyes, crosses, and other unions.
CableTray |  Draws cable tray runs such as rigid ladder or channel cable tray.
Conduit |  Draws rigid conduit runs.
ManageTemplates |  Manages and applies panel schedule templates to existing schedules in the project.
EditATemplate |  Modifies a specific panel schedule template.
ParallelConduits |  Creates parallel runs of conduit based on an initial conduit run.
DuctPlaceholder |  Draws placeholder duct without elbow or tee fittings.
PipePlaceholder |  Draws placeholder pipe without elbow or tee fittings.
ParallelPipes |  Creates parallel runs of pipe based on an initial pipe run.
ShowDisconnects |  Controls the display of graphical disconnect warnings for duct, pipe, conduit, cable tray, and electrical circuits.
SiteComponent |  Adds site-specific elements, such as trees, parking islands, and fire hydrants.
AreaAndVolumeComputations |  Specifies how areas and volumes are calculated, and creates area schemes.
ShowWorkPlane |  Displays or hides the active work plane in the view.
Fascia |  Adds fascia to the edge of a roof, soffit, or other fascia, or to model lines.
Gutter |  Adds a gutter to the edge of a roof, soffit, or fascia, or to model lines.
SlabEdgeFloor |  Shapes the horizontal edge of a floor slab.
CheckSpelling |  Checks the spelling of text notes in a selection or in the current view or sheet.
RepeatingDetailComponent |  Repeats a detail component along a path.
InsertViewsFromFile |  Copies specified views (sheets, schedules, or drafting views) from a project file and saves them in the current project.
Insert2DElementsFromFile |  Copies 2D elements from a detail view (saved in another project) into a detail view in the current project.
SaveAsLibraryView |  Saves a copy of all loaded families, the selected family, group, or view to your library.
AutomaticBeamSystem |  Creates a layout that is used to control the number and spacing of a series of parallel beams.
PlaceMass |  Places an instance of a mass family in the project.
InPlaceMass |  Creates a mass that is unique to the project.
SynchronizeNow |  Updates a local copy of a workshared project using settings from the Synchronize with Central dialog.
ExportGBXML |  Saves the project as a gbXML file.
StructuralTrusses |  Adds a truss to the structure model.
ShowLastReport |  Displays the most recent interference check report.
GraphicalColumnSchedule |  Creates a graphical column schedule for the project.
ApplyCoping |  Adds coping to steel beams and columns.
RemoveCoping |  Removes coping from steel beams and columns.
BeamSystemSymbol |  Places a beam system span tag.
StructuralAreaReinforcement |  Sketches the boundary of an area to populate with rebar.
AreaReinforcementSymbol |  Places a symbol that shows extents and hook types for the selected area reinforcement.
SolidSweptBlend |  Creates a blend that sweeps along a defined path.
VoidSweptBlend |  Creates a blend that sweeps along a defined path, and uses the resulting 3D shape to remove part of a solid 3D shape.
EditRebarCover |  Edits the rebar cover references of an entire rebar host or an individual face.
ColorSchemes |  Creates or modifies a color fill scheme for rooms and areas.
TrimOrExtendToCorner |  Trims or extends elements (such as walls or beams) to form a corner.
TrimOrExtendSingleElement |  Trims or extends one element (such as a wall, line, or beam) to a boundary defined by another element.
TrimOrExtendMultipleElements |  Trims or extends multiple elements (such as walls, lines, and beams) to a boundary defined by another element.
AlignedDimension |  Places dimensions between parallel references, or between multiple points.
LinearDimension |  Places horizontal or vertical dimensions that measure the distance between reference points.
AngularDimension |  Places a dimension that measures the angle between reference points sharing a common intersection.
RadialDimension |  Places a dimension that measures the radius of an inner curve or fillet.
ArcLengthDimension |  Places a dimension that measures the length of a curved wall or other element.
MeasureBetweenTwoReferences |  Measures the distance between 2 elements or other references.
MeasureAlongAnElement |  Measures the length of an element.
MirrorDrawAxis |  Draws a temporary line to use as an axis for mirroring.
KeyboardShortcuts |  Assigns key sequences to tools.
BeamOrColumnJoins |  Adjusts how beams and columns frame into one another.
SaveAsTemplate |  Saves the current Revit project file as a template.
HalftoneOrUnderlay |  Customizes halftone and underlay elements in view.
StairBySketch |  Adds a stair to the building model by sketching runs.
LoadCases |  Adds and edits load cases for the analytical model.
LoadCombinations |  Adds and edits load combinations for the analytical model.
FindOrReplace |  Finds and replaces text in an open project file.
EnergySettings |  Specifies parameters used to create the energy analytical model plus energy related data used in the energy simulation.
RunEnergySimulation |  Subscription only feature. Sends energy analytical model and parameters to Autodesk Green Building Studio for simulation.
ResultsAndCompare |  Displays graphical results of energy simulation, and provides tools for comparing, emailing, and exporting analysis results.
ExportMassModelGBXML |  Saves the conceptual energy model as a gbXML file.
GuideGrid |  Creates a new guide element in the active sheet to help align elements within and between sheets.
CreateAssembly |  Creates an assembly from elements you select in the drawing area.
StairTreadOrRiserNumber |  Creates a sequence of tread or riser numbers for a run in plan, elevation, or section views.
ManageConnectionToARevitServerAccelerator
RenderInCloud |  Renders 3D views online to create still images or interactive panoramas.
RenderGallery |  Opens your online gallery of completed and in-progress renderings in a web browser.
ShowEnergyModel |  Displays or hides the energy analytical model.
DisplaceElements |  Creates a view-specific representation of model elements that can be displaced in the view.
AssemblyCode |  Specifies the location of the assembly code file or reloads the assembly code table from the current file.
FabricationPart |  Displays the Fabrication Part Browser pane.
Playlist |  Provides an easy way to use Dynamo content.
OpenRevitFile |  Opens any Revit file type.
Close |  Close Revit.
Save |  Saves the currently open project file.
SaveAsProject |  Saves the current Revit project file.
PrintSetup |  Specifies print options.
Print |  Sends the current drawing area or selected views and sheets to a printer or a printable file.
PrintPreview |  Displays a preview version of the current view or sheet to print.
ModelBrowserContainer |  Show or hide model browser container.
CopyToClipboard |  Copies selected elements to the clipboard.
CutToClipboard |  Removes selected elements, and places them on the clipboard.
PasteFromClipboard |  Pastes elements from the clipboard into the current view.
TabViews |  Arranges all open views in drawing area into one tab group.
TileViews |  Tiles all tabbed views in drawing area into seperate tab groups.
ExitRevit |  Exit Revit.
StatusBar |  Displays the status bar at the bottom of the Revit window.
See Also
Autodesk.Revit.UI Namespace